[
  {
    "mistake": "The qulck brovln fox jumpr over the lary dog.",
    "correction": "The quick brown fox jumps over the lazy dog."
  },
  {
    "mistake": "lntroductlon to Comyuter Science.",
    "correction": "Introduction to Computer Science."
  },
  {
    "mistake": "Pleese pass the sall and yinegar.",
    "correction": "Please pass the salt and vinegar."
  },
  {
    "mistake": "I am goiny to the grocary store.",
    "correction": "I am going to the grocery store."
  },
  {
    "mistake": "Mary had a little lamh, its fleecl was white as snow.",
    "correction": "Mary had a little lamb, its fleece was white as snow."
  },
  {
    "mistake": "Tha weather ts sunry and warm today.",
    "correction": "The weather is sunny and warm today."
  },
  {
    "mistake": "Wondarful experlence at the new restaurant.",
    "correction": "Wonderful experience at the new restaurant."
  },
  {
    "mistake": "1 love c0ffee in the mornlng.",
    "correction": "I love coffee in the morning."
  },
  {
    "mistake": "He botght a new bo0k from the store.",
    "correction": "He bought a new book from the store."
  },
  {
    "mistake": "The company announred a new product line.",
    "correction": "The company announced a new product line."
  },
  {
    "mistake": "Dlrectlons to the neerest petrol statlon?",
    "correction": "Directions to the nearest petrol station?"
  },
  {
    "mistake": "Prepere the ingredlents for the cake.",
    "correction": "Prepare the ingredients for the cake."
  },
  {
    "mistake": "She plays the violln becutifully.",
    "correction": "She plays the violin beautifully."
  },
  {
    "mistake": "It was a dazk and stormy niaht.",
    "correction": "It was a dark and stormy night."
  },
  {
    "mistake": "The elephant ls the largest land animal.",
    "correction": "The elephant is the largest land animal."
  },
  {
    "mistake": "The conferencs will take plaoe in June.",
    "correction": "The conference will take place in June."
  },
  {
    "mistake": "Thls ls the key to the secret door.",
    "correction": "This is the key to the secret door."
  },
  {
    "mistake": "Her favorite flowers are lllies and roses.",
    "correction": "Her favorite flowers are lilies and roses."
  },
  {
    "mistake": "He plays soccer on the weekends.",
    "correction": "He plays soccer on the weekends."
  },
  {
    "mistake": "The dessert menu lncludes cake, ice cream, and fruit.",
    "correction": "The dessert menu includes cake, ice cream, and fruit."
  },
  {
    "mistake": "The company announred a new product line.",
    "correction": "The company announced a new product line."
  },
  {
    "mistake": "Todsy is going to be a beautilul day.",
    "correction": "Today is going to be a beautiful day."
  },
  {
    "mistake": "The children were playtng happitly in the park.",
    "correction": "The children were playing happily in the park."
  },
  {
    "mistake": "My favarite colar is bllue.",
    "correction": "My favorite color is blue."
  },
  {
    "mistake": "We wnt to the beach and ate ice crean.",
    "correction": "We went to the beach and ate ice cream."
  },
  {
    "mistake": "The mokey climg up the tree to get a banava.",
    "correction": "The monkey climbed up the tree to get a banana."
  },
  {
    "mistake": "I need to shaprpen my pencel.",
    "correction": "I need to sharpen my pencil."
  },
  {
    "mistake": "She dronk orange juce with her breakfast.",
    "correction": "She drank orange juice with her breakfast."
  },
  {
    "mistake": "The studants were rradinng the book quietly.",
    "correction": "The students were reading the book quietly."
  },
  {
    "mistake": "I like to eat cerial for breakfast.",
    "correction": "I like to eat cereal for breakfast."
  },
  {
    "mistake": "The sun is shinning and the birs are chirping.",
    "correction": "The sun is shining and the birds are chirping."
  },
  {
    "mistake": "The fliht was delaided due to bad weather.",
    "correction": "The flight was delayed due to bad weather."
  },
  {
    "mistake": "I need to get my hair cut at the salon.",
    "correction": "I need to get my hair cut at the salon."
  },
  {
    "mistake": "My mother cooked a delisious dinner for us.",
    "correction": "My mother cooked a delicious dinner for us."
  },
  {
    "mistake": "I enjoy listning to music in my free time.",
    "correction": "I enjoy listening to music in my free time."
  },
  {
    "mistake": "I am learnning how to play the guitar.",
    "correction": "I am learning how to play the guitar."
  },
  {
    "mistake": "The cat climed up the tree to catch a bird.",
    "correction": "The cat climbed up the tree to catch a bird."
  },
  {
    "mistake": "I am studyng hard for my final exams.",
    "correction": "I am studying hard for my final exams."
  },
  {
    "mistake": "I went to the movis with my friends last night.",
    "correction": "I went to the movies with my friends last night."
  },
  {
    "mistake": "The baby was cryng and would not stop.",
    "correction": "The baby was crying and would not stop."
  },
  {
    "mistake": "The buss drivar was very friendly and helpful.",
    "correction": "The bus driver was very friendly and helpful."
  },
  {
    "mistake": "I saw a beautifull rainbow in the sky yesterday.",
    "correction": "I saw a beautiful rainbow in the sky yesterday."
  }
]